In [43]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plot

In [2]:
series = pd.Series([1, 3, 5, np.nan, 6, 8])
series

# a one-dimensional labeled array holding data of any type

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

# a two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns.

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
dataframe = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [6]:
dataframe_2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

dataframe_2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
dataframe_2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [8]:
dataframe.head()

# view the top of the dataframe

                   A         B         C         D
2013-01-01  0.702006  0.117909 -1.945365  1.274587
2013-01-02  0.939278 -0.036118  0.589004  0.315795
2013-01-03  0.216035  0.060478 -1.007825 -0.052499
2013-01-04 -0.295985 -0.263915  2.528041  0.259894
2013-01-05  0.012275 -0.658902 -0.339179  0.470366

In [9]:
dataframe.tail()

# view the bottom of the dataframe

                   A         B         C         D
2013-01-02  0.939278 -0.036118  0.589004  0.315795
2013-01-03  0.216035  0.060478 -1.007825 -0.052499
2013-01-04 -0.295985 -0.263915  2.528041  0.259894
2013-01-05  0.012275 -0.658902 -0.339179  0.470366
2013-01-06  0.389877  0.722300 -0.286201 -0.931168

In [10]:
dataframe.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
dataframe.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
dataframe.to_numpy()

#arrays have one dtype for the entire array while pandas DataFrames have one dtype per column. When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. If the common data type is object, DataFrame.to_numpy() will require copying data.

array([[ 0.70200569,  0.11790939, -1.94536457,  1.27458697],
       [ 0.93927788, -0.03611774,  0.5890039 ,  0.31579536],
       [ 0.21603523,  0.06047823, -1.00782462, -0.05249896],
       [-0.2959846 , -0.26391535,  2.52804132,  0.25989363],
       [ 0.01227536, -0.65890172, -0.33917934,  0.47036553],
       [ 0.38987735,  0.72230029, -0.2862007 , -0.93116844]])

In [13]:
dataframe.describe()

#display some info about the dataframe

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.327248 -0.009708 -0.076921  0.222829
std    0.451429  0.456907  1.529675  0.719027
min   -0.295985 -0.658902 -1.945365 -0.931168
25%    0.063215 -0.206966 -0.840663  0.025599
50%    0.302956  0.012180 -0.312690  0.287844
75%    0.623974  0.103552  0.370203  0.431723
max    0.939278  0.722300  2.528041  1.274587

In [14]:
dataframe.T

# display the dataframe as a table

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.702006    0.939278    0.216035   -0.295985    0.012275    0.389877
B    0.117909   -0.036118    0.060478   -0.263915   -0.658902    0.722300
C   -1.945365    0.589004   -1.007825    2.528041   -0.339179   -0.286201
D    1.274587    0.315795   -0.052499    0.259894    0.470366   -0.931168

In [15]:
dataframe.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.274587 -1.945365  0.117909  0.702006
2013-01-02  0.315795  0.589004 -0.036118  0.939278
2013-01-03 -0.052499 -1.007825  0.060478  0.216035
2013-01-04  0.259894  2.528041 -0.263915 -0.295985
2013-01-05  0.470366 -0.339179 -0.658902  0.012275
2013-01-06 -0.931168 -0.286201  0.722300  0.389877

In [16]:
dataframe.sort_values(by="B")

                   A         B         C         D
2013-01-05  0.012275 -0.658902 -0.339179  0.470366
2013-01-04 -0.295985 -0.263915  2.528041  0.259894
2013-01-02  0.939278 -0.036118  0.589004  0.315795
2013-01-03  0.216035  0.060478 -1.007825 -0.052499
2013-01-01  0.702006  0.117909 -1.945365  1.274587
2013-01-06  0.389877  0.722300 -0.286201 -0.931168

In [17]:
dataframe["A"]

# passing a single label selects a columns and yields a Series equivalent

2013-01-01    0.702006
2013-01-02    0.939278
2013-01-03    0.216035
2013-01-04   -0.295985
2013-01-05    0.012275
2013-01-06    0.389877
Freq: D, Name: A, dtype: float64

In [18]:
dataframe[0:3]

# works as slice (JS SAYS HI)

                   A         B         C         D
2013-01-01  0.702006  0.117909 -1.945365  1.274587
2013-01-02  0.939278 -0.036118  0.589004  0.315795
2013-01-03  0.216035  0.060478 -1.007825 -0.052499

In [19]:
dataframe.loc[dates[0]]

# specifically retrieves the row from dataframe that corresponds to the index label specified by dates[0]

A    0.702006
B    0.117909
C   -1.945365
D    1.274587
Name: 2013-01-01 00:00:00, dtype: float64

In [20]:
dataframe.loc[:, ["A", "B"]]

# select all rows (:) with a select column labels

                   A         B
2013-01-01  0.702006  0.117909
2013-01-02  0.939278 -0.036118
2013-01-03  0.216035  0.060478
2013-01-04 -0.295985 -0.263915
2013-01-05  0.012275 -0.658902
2013-01-06  0.389877  0.722300

In [21]:
dataframe.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.939278 -0.036118
2013-01-03  0.216035  0.060478
2013-01-04 -0.295985 -0.263915

In [22]:
dataframe.loc[dates[0], "A"]

0.702005694513561

In [23]:
dataframe.iloc[3]

# celect via the position of the passed integers:

A   -0.295985
B   -0.263915
C    2.528041
D    0.259894
Name: 2013-01-04 00:00:00, dtype: float64

In [24]:
dataframe.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.295985 -0.263915
2013-01-05  0.012275 -0.658902

In [25]:
dataframe.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.939278  0.589004
2013-01-03  0.216035 -1.007825
2013-01-05  0.012275 -0.339179

In [26]:
dataframe.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.939278 -0.036118  0.589004  0.315795
2013-01-03  0.216035  0.060478 -1.007825 -0.052499

In [27]:
dataframe.iloc[:, 1:3]

                   B         C
2013-01-01  0.117909 -1.945365
2013-01-02 -0.036118  0.589004
2013-01-03  0.060478 -1.007825
2013-01-04 -0.263915  2.528041
2013-01-05 -0.658902 -0.339179
2013-01-06  0.722300 -0.286201

In [28]:
dataframe.iloc[1, 1]

-0.03611774229548531

In [29]:
dataframe.iat[1, 1]

-0.03611774229548531

In [30]:
dataframe[dataframe["A"] > 0]

                   A         B         C         D
2013-01-01  0.702006  0.117909 -1.945365  1.274587
2013-01-02  0.939278 -0.036118  0.589004  0.315795
2013-01-03  0.216035  0.060478 -1.007825 -0.052499
2013-01-05  0.012275 -0.658902 -0.339179  0.470366
2013-01-06  0.389877  0.722300 -0.286201 -0.931168

In [31]:
dataframe[dataframe > 0]

                   A         B         C         D
2013-01-01  0.702006  0.117909       NaN  1.274587
2013-01-02  0.939278       NaN  0.589004  0.315795
2013-01-03  0.216035  0.060478       NaN       NaN
2013-01-04       NaN       NaN  2.528041  0.259894
2013-01-05  0.012275       NaN       NaN  0.470366
2013-01-06  0.389877  0.722300       NaN       NaN

In [32]:
dataframe_3 = dataframe.copy()

dataframe_3["E"] = ["one", "one", "two", "three", "four", "three"]

dataframe_3

                   A         B         C         D      E
2013-01-01  0.702006  0.117909 -1.945365  1.274587    one
2013-01-02  0.939278 -0.036118  0.589004  0.315795    one
2013-01-03  0.216035  0.060478 -1.007825 -0.052499    two
2013-01-04 -0.295985 -0.263915  2.528041  0.259894  three
2013-01-05  0.012275 -0.658902 -0.339179  0.470366   four
2013-01-06  0.389877  0.722300 -0.286201 -0.931168  three

In [33]:
dataframe[dataframe["E"].isin(["two", "four"])]

KeyError: 'E'

In [34]:
series = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
series

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [35]:
dataframe["F"] = series_2
dataframe

NameError: name 'series_2' is not defined

In [36]:
dataframe.at[dates[0], "A"] = 0

In [37]:
dataframe.iat[0, 1] = 0

In [38]:
dataframe

                   A         B         C         D
2013-01-01  0.000000  0.000000 -1.945365  1.274587
2013-01-02  0.939278 -0.036118  0.589004  0.315795
2013-01-03  0.216035  0.060478 -1.007825 -0.052499
2013-01-04 -0.295985 -0.263915  2.528041  0.259894
2013-01-05  0.012275 -0.658902 -0.339179  0.470366
2013-01-06  0.389877  0.722300 -0.286201 -0.931168

In [39]:
dataframe_2 = dataframe.copy()
dataframe_2[dataframe_2 > 0] = -dataframe_2
dataframe_2

                   A         B         C         D
2013-01-01  0.000000  0.000000 -1.945365 -1.274587
2013-01-02 -0.939278 -0.036118 -0.589004 -0.315795
2013-01-03 -0.216035 -0.060478 -1.007825 -0.052499
2013-01-04 -0.295985 -0.263915 -2.528041 -0.259894
2013-01-05 -0.012275 -0.658902 -0.339179 -0.470366
2013-01-06 -0.389877 -0.722300 -0.286201 -0.931168

In [40]:
dataframe = dataframe.reindex(index=dates[0:4], columns=list(dataframe.columns) + ["E"])
dataframe.loc[dates[0] : dates[1], "E"] = 1
dataframe

# reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data:

                   A         B         C         D    E
2013-01-01  0.000000  0.000000 -1.945365  1.274587  1.0
2013-01-02  0.939278 -0.036118  0.589004  0.315795  1.0
2013-01-03  0.216035  0.060478 -1.007825 -0.052499  NaN
2013-01-04 -0.295985 -0.263915  2.528041  0.259894  NaN

In [75]:
dataframe.dropna(how="any")

                   A        B         C         D    F    E
2013-01-02 -0.802277  0.74365  1.541435 -0.106986  1.0  1.0

In [76]:
dataframe.fillna(value=5)

                   A         B         C         D    F    E
2013-01-01  0.000000  0.000000 -0.778813  0.610548  5.0  1.0
2013-01-02 -0.802277  0.743650  1.541435 -0.106986  1.0  1.0
2013-01-03  0.890194  0.771746  0.439857 -0.729508  2.0  5.0
2013-01-04  1.157568  0.917720  0.998139  0.458708  3.0  5.0

In [77]:
pd.isna(dataframe_5)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [79]:
dataframe.mean()

# calculate the mean value for each column

A    0.460848
B    0.185321
C    0.436010
D   -0.438968
F    3.000000
dtype: float64

In [80]:
dataframe.mean(axis=1)
# calculate the mean value for each row

2013-01-01   -0.042066
2013-01-02    0.475164
2013-01-03    0.674458
2013-01-04    1.306427
2013-01-05    0.655251
2013-01-06    0.694205
Freq: D, dtype: float64

In [159]:
series = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
series

# operating with another Series or DataFrame with a different index or column will align the result with the union of the index or column labels. In addition, pandas automatically broadcasts along the specified dimension and will fill unaligned labels with np.nan

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [85]:
dataframe.agg(lambda x: np.mean(x) * 5.6)

# as callback in JS

A     2.580750
B     1.037798
C     2.441654
D    -2.458223
F    16.800000
dtype: float64

In [86]:
dataframe.transform(lambda x: x * 101.2)

                     A           B           C           D      F
2013-01-01    0.000000    0.000000  -78.815841   61.787413    NaN
2013-01-02  -81.190421   75.257395  155.993184  -10.826965  101.2
2013-01-03   90.087666   78.100694   44.513482  -73.826232  202.4
2013-01-04  117.145846   92.873254  101.011662   46.421256  303.6
2013-01-05   78.952302   12.994467  -11.926265 -153.263279  404.8
2013-01-06   74.831627 -146.698855   53.968884 -136.833824  506.0

In [158]:
series = pd.Series(np.random.randint(0, 7, size=10))
series
series.value_counts()

4    3
5    2
0    2
1    1
6    1
2    1
Name: count, dtype: int64

In [157]:
series = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
series.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [156]:
dataframe = pd.DataFrame(np.random.randn(10, 4))
pieces = [dataframe[:3], dataframe[3:7], dataframe[7:]]
pd.concat(pieces)

          0         1         2         3
0  2.111329  1.218152 -0.456184  0.263298
1  0.714761  0.161066  0.072266  0.370510
2  0.223835 -0.230898  0.810208  2.953939
3  1.191179  1.146617  0.964507 -0.757894
4  0.343212 -0.599972  0.137297  0.513403
5  0.646080  2.139846  1.427481  0.682170
6 -1.344551 -0.145714  0.513790  0.407844
7  0.865199 -0.624594  0.878895 -0.974150
8 -0.580891  0.894343 -2.786215 -0.393045
9 -0.278202  0.637338  0.066712  2.126846

In [93]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
pd.merge(left, right, on="key")

# as SQL join

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [94]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [155]:
dataframe = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

dataframe

     A      B         C         D
0  foo    one  0.899375  0.801575
1  bar    one  0.696018  1.254637
2  foo    two  0.992840  1.617547
3  bar  three  0.943969  0.241328
4  foo    two -0.595635 -0.519813
5  bar    two -1.570014  1.061380
6  foo    one -0.089049  0.243775
7  foo  three -0.504499 -0.323224

In [97]:
dataframe.groupby("A")[["C", "D"]].sum()

            C         D
A
bar  0.882916  1.101049
foo -1.167499 -1.685606

In [98]:
dataframe.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    0.459673 -0.302232
    three  0.680559  0.907349
    two   -0.257316  0.495932
foo one   -1.110034 -0.371156
    three -0.645628 -0.128628
    two    0.588162 -1.185822

In [149]:
arrays = [
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"],
         ] 

index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

dataframe = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

dataframe_2 = dataframe[:4]

dataframe_2

                     A         B
first second
bar   one    -0.425070  1.396883
      two    -0.064627 -0.056815
baz   one     0.172441 -1.807751
      two     1.557995 -0.626849

In [150]:
stacked = dataframe_2.stack(future_stack=True)
stacked

# compresses a level in the DataFrames columns:

first  second
bar    one     A   -0.425070
               B    1.396883
       two     A   -0.064627
               B   -0.056815
baz    one     A    0.172441
               B   -1.807751
       two     A    1.557995
               B   -0.626849
dtype: float64

In [110]:
stacked.unstack()

                     A         B
first second
bar   one    -0.720780  0.032942
      two     1.754559 -1.220654
baz   one     1.504971 -0.250981
      two     0.252044  0.573103

In [112]:
stacked.unstack(1)

first          bar       baz
second
one    A -0.720780  1.504971
       B  0.032942 -0.250981
two    A  1.754559  0.252044
       B -1.220654  0.573103

In [113]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.720780  1.504971
       B  0.032942 -0.250981
two    A  1.754559  0.252044
       B -1.220654  0.573103

In [148]:
dataframe = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

pd.pivot_table(dataframe, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A -0.847583 -0.961976
      B -0.455607  1.061060
      C  0.177128  0.736608
three A -1.102376       NaN
      B       NaN  0.405825
      C -1.424024       NaN
two   A       NaN -1.001011
      B -0.542064       NaN
      C       NaN -1.065777

In [181]:
range_date = pd.date_range("1/1/2012", periods=100, freq="s")
time_series = pd.Series(np.random.randint(0, 500, len(range_date)), index=range_date)
time_series.resample("5Min").sum()

2012-01-01    24741
Freq: 5min, dtype: int32

In [184]:
range_date_2 = pd.date_range("3/6/2012 00:00", periods=5, freq="D")
times_series = pd.Series(np.random.randn(len(range_date_2)), range_date_2)
times_series
time_series_utc = times_series.tz_localize("UTC")
time_series_utc
time_series_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00   -0.396629
2012-03-06 19:00:00-05:00   -0.843895
2012-03-07 19:00:00-05:00    0.134072
2012-03-08 19:00:00-05:00    0.510531
2012-03-09 19:00:00-05:00    1.911753
Freq: D, dtype: float64

In [185]:
range_date_2
range_date_2 + pd.offsets.BusinessDay(5)

DatetimeIndex(['2012-03-13', '2012-03-14', '2012-03-15', '2012-03-16',
               '2012-03-16'],
              dtype='datetime64[ns]', freq=None)

In [204]:
dataframe = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)

dataframe["grade"] = dataframe["raw_grade"].astype("category")

dataframe["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [144]:
new_categories = ["very good", "good", "very bad"]

# reminds me ETEC

In [205]:
dataframe["grade"] = dataframe["grade"].cat.rename_categories(new_categories)

dataframe["grade"] = dataframe["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"]
)

dataframe["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [207]:
dataframe.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [206]:
dataframe.groupby("grade", observed=False).size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

In [138]:
time_series = pd.Series(np.random.randn(1000), index=pd.date_range("1/1/2000", periods=1000))

time_series = time_series.cumsum()

time_series.plot()

In [44]:
plot.close("all")

dataframe = pd.DataFrame(
    np.random.randn(1000, 4), index=time_series.index, columns=["A", "B", "C", "D"]
)

dataframe = dataframe.cumsum()

plot.figure()

dataframe.plot()

plot.legend(loc='best')

NameError: name 'time_series' is not defined

In [141]:
plot.close("all")

dataframe = pd.DataFrame(np.random.randint(0, 5, (10, 5)))

dataframe.to_csv("foo.csv")

In [ ]:
dataframe.to_parquet("foo.parquet")

In [ ]:
dataframe.to_excel("foo.xlsx", sheet_name="Sheet1")

In [41]:
if pd.Series([False, True, False]):
     print("I was true")

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().